Repository: jacek13/DevToys.PolishDataGen
Catalog: src/DevToys.PolishDataGen/Strings/PolishDataGen.*.resx
Languages: pl_pl

# AccessibleName
source: Allows generation of PESEL, NIP, REGON
pl_pl: Umożliwia generowanie PESEL, NIP, REGON

# CliEnableMultithreading
source: when enabled app will run k = 1 + 3.3 * Log10(Number) jobs
pl_pl: Po włączeniu aplikacja uruchomi k = 1 + 3.3 * Log10(LICZBA_IDENTYFIKATORÓW) zadań

# CliIdType
source: Select id type. Current available options are: pesel | nip | regon | regon-long | identity-card-number
pl_pl: Wybierz typ identyfikatora. Aktualnie dostępne opcje to: pesel | nip | regon | regon-long | identity-card-number

# CliInfoBarContent
source: With such large numbers it is recommended to use the CLI version
pl_pl: Przy tak dużych liczbach zaleca się korzystanie z wersji CLI

# CliInfoBarTitle
source: Warning
pl_pl: Ostrzeżenie

# CliMultiLineTextInputTitle
source: Output
pl_pl: Wyjście

# CliNumberPropertyDescription
source: Defines the number of data to be generated
pl_pl: Określa liczbę danych do wygenerowania

# CliOutputFilePath
source: define output file path
pl_pl: Określa ścieżkę pliku wyjściowego

# CliValidatorDescription
source: The tool allows validation of Polish identification numbers. It is possible to return a short or detailed description (error list).
pl_pl: Narzędzie umożliwia walidację polskich numerów identyfikacyjnych. Możliwe jest zwrócenie krótkiego lub szczegółowego opisu (lista błędów).

# CliValidatorExtendedDetailsDescription
source: Displays a detailed list of validation errors
pl_pl: Wyświetla szczegółową listę błędów walidacji

# CliValidatorInput
source: Input field for value to be checked
pl_pl: Wartość wejściowa do sprawdzenia

# CliValidatorIntegerAsResult
source: Allows you to return an integer as the result. 1 - True, 0 - False, -1 - Error
pl_pl: Umożliwia zwrócenie liczby całkowitej jako wyniku. 1 - Prawda, 0 - Fałsz, -1 - Błąd

# Description
source: Library for generating correct Polish identifiers: PESEL, NIP, REGON and more. Perfect for testing and validating systems.
pl_pl: Biblioteka do generowania poprawnych polskich identyfikatorów: PESEL, NIP, REGON i inne. Idealna do testowania i walidacji systemów.

# GuiClearMemoryButtonLabel
source: Clear memory
pl_pl: Wyczyść pamięć

# GuiGenerateButtonLabel
source: Generate
pl_pl: Generuj

# GuiNumberInputLabel
source: Number of data to generate
pl_pl: Liczba danych do wygenerowania

# GuiValidateButtonLabel
source: Validate
pl_pl: Waliduj

# GuiValidationDescription
source: Allows validation of Polish identification numbers.
pl_pl: Umożliwia walidację polskich numerów identyfikacyjnych.

# GuiValidationErrorTitle
source: Validation error
pl_pl: Błąd walidacji

# GuiValidationLongDisplayTitle
source: Polish ids validation
pl_pl: Walidacja polskich danych

# GuiValidationSelectTypeLabel
source: Select validation type
pl_pl: Wybierz typ walidacji

# GuiValidationShortDisplayTitle
source: Polish Data Validation
pl_pl: Walidacja polskich danych

# GuiValidationSuccessTitle
source: Success
pl_pl: Sukces

# GuiValidationTextInputLabel
source: Enter id
pl_pl: Wprowadź identyfikator

# IdentityCardControlNumberValidationMessage
source: IdentityCardNumber invalid control number
pl_pl: Numer dowodu osobistego posiada nieprawidłowy numer kontrolny

# IdentityCardNumberExtremeValuesValidationMessage
source: Identity Card Number cannot be composed only from 0 or 9 digits
pl_pl: Numer dowodu osobistego nie może składać się wyłącznie z cyfr 0 lub 9.

# IdentityCardNumberNotEmptyMessage
source: Identity Card Number must contain some value
pl_pl: Numer dowodu osobistego musi zawierać jakąś wartość

# IdentityCardNumberNumericPartValidationMessage
source: Identity Card Number numeric part should contains only digits
pl_pl: Numer dowodu osobistego w części numerycznej powinien zawierać wyłącznie cyfry

# IdentityCardNumberPrefixPartValidationMessage
source: Identity Card Number prefix must contain only upper ascii characters
pl_pl: Numer dowodu osobistego w prefiksie musi zawierać wielkie litery

# IdentityCardNumberValidationLengthMessage
source: Identity Card Number must be 9 characters long
pl_pl: Numer dowodu osobistego musi składać się z 9 znaków

# LongDisplayTitle
source: Polish Data Generator
pl_pl: Generator polskich danych

# NipValidationControlNumberMessage
source: NIP invalid control number
pl_pl: NIP posiada nieprawidłowy numer kontrolny

# NipValidationExtremeValuesMessage
source: NIP cannot be composed only from 0 or 9 digits
pl_pl: NIP nie może składać się tylko z cyfr 0 lub 9

# NipValidationInvalidPrefix
source: NIP must have as a prefix (first 3 digits) the valid tax office number
pl_pl: NIP musi mieć jako prefiks (pierwsze 3 cyfry) istniejący numer urzędu skarbowego

# NipValidationLengthMessage
source: NIP must be 10 characters long
pl_pl: NIP musi składać się z 10 znaków

# NipValidationNotEmptyMessage
source: NIP must contain some value
pl_pl: NIP musi zawierać jakąś wartość

# NipValidationOnlyDigitsMessage
source: NIP must contain only digits
pl_pl: NIP musi składać się wyłącznie z cyfr

# PeselValidationControlNumberMessage
source: PESEL invalid control number
pl_pl: PESEL posiada nieprawidłowy numer kontrolny

# PeselValidationDayRangeMessage
source: PESEL Day part must be in range 1 to 31
pl_pl: PESEL część zarezerwowana dla dni DD musi mieścić się w zakresie od 1 do 31

# PeselValidationExtremeValuesMessage
source: PESEL cannot be composed only from 0 or 9 digits
pl_pl: PESEL nie może składać się tylko z cyfr 0 lub 9

# PeselValidationLengthMessage
source: PESEL must be 11 characters long
pl_pl: PESEL musi składać się z 11 znaków

# PeselValidationMonthRangeMessage
source: PESEL Month part must be in range 1 to 12
pl_pl: PESEL część zarezerwowana dla miesięcy MM musi mieścić się w zakresie od 1 do 12

# PeselValidationNotEmptyMessage
source: PESEL must contain some value
pl_pl: PESEL musi zawierać jakąś wartość

# PeselValidationOnlyDigitsMessage
source: PESEL must contain only digits
pl_pl: PESEL musi składać się wyłącznie z cyfr

# PolishDataGenLabel
source: Generate Polish IDs
pl_pl: Generuj polskie identyfikatory

# RegonValidationControlNumberMessage
source: REGON invalid control number
pl_pl: REGON posiada nieprawidłowy numer kontrolny

# RegonValidationExtremeValuesMessage
source: REGON cannot be composed only from 0 or 9 digits
pl_pl: REGON nie może składać się tylko z cyfr 0 lub 9

# RegonValidationLengthMessage
source: REGON must be 9 or 14 characters long
pl_pl: REGON musi składać się z 9 lub 14 znaków

# RegonValidationNotEmptyMessage
source: REGON must contain some value
pl_pl: REGON musi zawierać jakąś wartość

# RegonValidationOnlyDigitsMessage
source: REGON must contain only digits
pl_pl: REGON musi składać się wyłącznie z cyfr

# ShortDisplayTitle
source: Polish Data Gen
pl_pl: Generator polskich danych
